Revit 2024 API
RebarUpdateCurvesData.SetHookPlaneNormalForBarIdx Method
 Set the normal of plane in which the hook at end of bar with index barPositionIndex will stay. This information is set to the rebar after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public void SetHookPlaneNormalForBarIdx(
	int end,
	int barPositionIndex,
	XYZ hookNormal
)
Visual Basic
Public Sub SetHookPlaneNormalForBarIdx ( _
	end As Integer, _
	barPositionIndex As Integer, _
	hookNormal As XYZ _
)
Visual C++
public:
void SetHookPlaneNormalForBarIdx(
	int end,
	int barPositionIndex,
	XYZ^ hookNormal
)
Parameters
end
Type: System.Int32
 The end of bar. Should be 0 for start or 1 for end.
barPositionIndex
Type: System.Int32
 Index of the bar for which it will set hook plane normal.
hookNormal
Type: Autodesk.Revit.DB.XYZ
 The normal of plane in which the hook at end of bar with index barPositionIndex will stay.
Remarks
 This information is set to the rebar after the API execution is finished successfully. Before setting the value a validation will be done. We consider a hook plane normal valid if it isn't parallel with the bar direction at end.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  Invalid end. -or- hookNormal has zero length.
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace